{"category":"City","category_link":"http://www.dailycal.org/section/news/city/","headline":"Berkeley’s most unpredictable buses","subhead":"We analyzed which buses around UC Berkeley arrive later than expected.","author":"Seokhyeon Ryu","dateline":"November 21, 2017","sections":[{"type":"text","text":"\nSahil Hansalia, a campus junior, takes the 51B bus every day to get to class. In the morning, he checks the Transit app on his phone to see when the next bus will arrive. Today, the app predicts the bus will come in 10 minutes. He knows he has a few minutes before he has to leave his apartment.\n\nMost of the time, the prediction is accurate. But some days, it changes. He checks the app five minutes later, and sees the predicted arrival time has increased to 12 minutes.\n\nHe decides to walk to campus instead.\n\n“I’d say 20 percent of the time, [the prediction] gets pushed back.” Hansalia said. “It’s annoying.” \n\nInstead of publishing a schedule for each stop on each bus route, AC Transit recommends passengers rely on “real-time” predictions provided by NextBus, a company that partners with transit agencies to provide transit information. AC Transit collects GPS data from its buses and sends the information to NextBus, which predicts departure times for each stop, taking into account historical traffic patterns, according to the NextBus website. \n\nNextBus’s predictions are available on AC Transit’s website, the NextBus app and the Transit app. We wanted to measure how often those predictions, which AC Transit recommends as a way for passengers to “manage [their] time more efficiently,” according to its <a href=\"http://www.actransit.org/rider-info/realtime/\">website</a>, are accurate."},{"type":"image","filename":"nextbus","caption":"A screenshot of the NextBus app. Here, the 51B bus to Berkeley Amtrak is predicted to depart from the stop on Bancroft Way and Telegraph Avenue in two minutes."},{"type":"text","text":"\nSince most stops don’t have a published schedule, we measured the gap between when the NextBus service <em>says</em> a bus is 20 minutes from a stop and when it <em>actually</em> arrives (according to the service). \n\nLet’s say you’re at the Bancroft Way and Telegraph Avenue bus stop."},{"type":"ai2html","filename":"demo"},{"type":"text","text":"\nUsing this approach, The Daily Californian monitored more than 45 thousand trips for 20 bus routes at 91 stops near campus in September and October. We collected data showing which stops and routes have arrival predictions that don’t always come true.\n\nBelow, each chart shows a selection of 100 trips on a route, along with the proportion that arrived more than five minutes later than predicted. Each arc represents one bus trip, starting 20 minutes before the bus is scheduled to arrive."},{"type":"ai2html","filename":"small-multiples"},{"type":"text","text":"\nIn the time period that we monitored, almost one third of the predicted arrivals for the F toward San Francisco were off by more than five minutes. The 18 toward Lake Merritt BART was relatively unpredictable as well.\n\nOther buses, such as the 7 toward Berkeley BART, arrived as predicted more often. The 51B toward Berkeley Amtrak arrived more than five minutes later than predicted only 5 percent of the time. \n\nThe spread in delay time varied, too. Arrivals for the 7 toward El Cerrito Del Norte were tightly clustered, but the 52 toward UC Village, while rarely more than 5 minutes late, saw more varied delay times."},{"type":"section-header","text":"Where delays are greatest"},{"type":"text","text":"\nWe also analyzed delayed trips at each stop, and found that delays were most prevalent along Shattuck Avenue southbound and Piedmont Avenue southbound. There were often delays on Bancroft Way and Telegraph Avenue, too."},{"type":"d3-graphic","id":"bubble-map"},{"type":"ai2html","filename":"bubble-map"},{"type":"text","text":"\nThe accuracy of predictions is limited by the unpredictability of traffic patterns and road conditions, as well as by the availability of up-to-the-minute location data. Currently, the location of AC Transit buses is recorded and sent to the NextBus service about every two minutes, according to A.J. Martin, a transportation planner at AC Transit. Soon, an upgrade to the tracking technology will enable AC Transit to record and transmit location data every 30 seconds, he said.\n\nAn internal task force meets monthly to address problematic routes, he added, and considers measures to improve timeliness. These include finding ways for buses to jump the queue at traffic lights, installing “transit-only lanes” that give buses priority and installing devices that enable buses to extend the duration of a green light."},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nWe recorded predicted and actual departure times at stops near campus for 11 lines from 5 a.m. to midnight. Below, you can explore the data for each stop.\n\nStops that have been temporarily changed because of construction do not have accurate predictions, so we excluded them from the map."},{"type":"interactive-map","id":"map-info"},{"type":"nerd-box","text":"In its <a href=\"http://www.actransit.org/planning-focus/data-resource-center/\">Data Resource Center</a>, AC Transit provides information for “the use of AC Transit services through the development of web-based applications.” Here, we learned how to poll data from the NextBus API for real-time predictions. We observed that predictions tended to change as a bus approached a stop. The predictions change by the minute, so we polled the API at every minute until each prediction disappeared (indicating the bus’s departure from that stop). This disappearance became our best estimate for the bus’s actual time of arrival, accurate to the minute. We compared this estimated arrival to the prediction at 20 minutes away, observing large differences between the two at many stops and routes. \n\nIt was difficult to determine how long of a wait should be considered a significant delay. We settled on a delay of at least 5 minutes, assuming that a prediction made 20 minutes before should have a somewhat reasonable prediction. This determination was made so that the frequency of such delays could be compared across stops and lines.\n\nThe route explorer on the bottom of the page was made possible with the <a href=\"http://openlayers.org/\">OpenLayers</a>, an open-source JavaScript library for creating dynamic maps.\n\nThis project is open-source on <a href=\"https://github.com/dailycal-projects/actransit\">GitHub</a>.\n\nSahil Chinoy contributed to this story."}]}
