{"category":"City","category_link":"http://www.dailycal.org/section/news/city/","headline":"Experiencing bus delays","subhead":"The Daily Californian tracked which buses are least likely to arrive on schedule","author":"Seokhyeon Ryu","dateline":"November 21, 2017","sections":[{"type":"text","text":"\nSahil Hansalia, a junior, takes the <span class=\"badge badge-51B\">51B</span> every day to get to class. In the morning, he checks the Transit app on his phone to see when the next bus will arrive. Today, the app predicts the bus will arrive at his stop in 10 minutes. He knows he has a few minutes before leaving his apartment.\n\nMost days, the prediction is accurate. But some days, the the prediction can change.\n\n\"I’d say 20 percent of the time, it get pushed back and it’s annoying,\" Hansalia said.\n\nAfter checking the app five minutes later, he sees the prediction has increased to 12 minutes. He decides to walk to campus instead.\n\nDelays like these are inevitable for those who plan their schedules around taking the bus. Particularly near campus and on Shattuck Avenue, there are longer-than-expected wait times for the bus to arrive. The main culprit appears to be traffic, which can come to a standstill on busy hours. The Daily Californian investigated the frequency and period of bus delays at stops surrounding campus.\n\nAC Transit publishes a schedule for a subset of stops along a route. For example, the <span class=\"badge badge-51B\">51B</span><span class=\"db\">Berkeley Amtrak</span> has scheduled times for five stops along that route. The remaining stops, however, do not have this information.\n\nInstead, AC Transit recommends passengers rely on “real-time” predictions provided by NextBus, a company that partners with transit agencies to provide transit information. AC Transit collects GPS data from its buses and sends the information to NextBus, which predicts their departure times at each stop, taking into account historical traffic patterns, according to their website. \n\nThe prediction service is available on AC Transit’s website and NextBus app. The Transit app shows real-time data on AC Transit buses directly from NextBus."},{"type":"section-header","text":"Defining ‘on-time performance’"},{"type":"text","text":"\nSince most stops don’t have a published schedule, in order to measure bus delays, The Daily Californian measured the time difference between when the NextBus service says a bus is 30 minutes from a stop and when it actually arrives (according to the service). \n\nLet us say you are at the Bancroft Way & Telegraph Ave bus stop."},{"type":"ai2html","filename":"demo"},{"type":"d3-graphic","id":"methodology"},{"type":"text","text":"\nEach arc represents one bus trip, starting 30 minutes before the bus is scheduled to arrive. In the example above, the arc ends when the bus actually arrived, 12 minutes late. Below, each chart shows a random selection of 100 trips on a given route."},{"type":"ai2html","filename":"small-multiples"},{"type":"text","text":"\nSome routes, such as F San Francisco and 18 Lake Merritt BART, have relatively unpredictable arrivals. Others, such as 51B Berkeley Amtrak and 36 West Oakland BART, are more reliably on time.\n\nAverage delay also varies, as F Berkeley experiences close to no delays, on average, while the F San Francisco in the other direction averages several minutes late. More on methodology is explained at the end of this article."},{"type":"section-header","text":"Where delays are greatest"},{"type":"text","text":"\nStops, not just routes, have variation in delay. In the bubble map below, each stop is represented by a circle whose size is proportional to the stop’s average delay (that includes all routes at that stop). Delays are highest along Shattuck southbound and Piedmont southbound. There is also a noticeably large average delay on Bancroft Way and Telegraph Ave."},{"type":"d3-graphic","id":"bubble-map"},{"type":"ai2html","filename":"bubble-map"},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nThe Daily Californian recorded prediction and departure times at stops nearby campus for 12 lines, from 5:00AM to 12:00AM, from"},{"type":"interactive-map","id":"map-info"},{"type":"text","text":"\nThe accuracy of predictions is limited by the availability of up-to-the-minute location data, as well as by unpredictability in traffic patterns and road conditions. Currently, the location of AC Transit buses is recorded and sent to the NextBus service about every two minutes, according to A.J. Martin, a transportation planner at AC Transit. Soon, an upgrade to the tracking technology will enable AC Transit to record and transmit location data about every 30 seconds, he said.\n\nAC Transit considers a bus “on time” if it arrives less than five minutes late and not more than one minute early. It aims for its buses to achieve this standard 72 percent of the time. Currently, it is not meeting that goal, according to Martin.\n\nAn AC Transit task force meets monthly to address problematic routes, he added, and considers measures to improve performance. These include finding ways for buses to jump the queue at traffic lights, installing “transit-only lanes” that give buses priority and installing devices that enable buses to extend the duration of a green light."}]}
