{"category":"City","category_link":"http://www.dailycal.org/section/news/city/","headline":"Waiting for AC Transit buses","subhead":"The Daily Californian tracked which buses around Berkeley are least predictable","author":"Seokhyeon Ryu","dateline":"November 21, 2017","sections":[{"type":"text","text":"\nSahil Hansalia, a campus junior, takes the 51B bus every day to get to class. In the morning, he checks the Transit app on his phone to see when the next bus will arrive. Today, the app predicts the bus will come in 10 minutes. He knows he has a few minutes before leaving his apartment.\n\nMost of the time, the prediction is accurate. But some days, it changes. After checking the app five minutes later, he sees the predicted arrival time has increased to 12 minutes. He decides to walk to campus instead.\n\n“I’d say 20 percent of the time, [the prediction] gets pushed back.” Hansalia said. “It’s annoying.” \n\nDelays such as these are common for those who plan their schedules around taking the bus. Particularly near campus and on Shattuck Avenue, the wait time for the next bus is sometimes  unpredictable.\n\nInstead of publishing a schedule for each stop on each bus route, AC Transit recommends passengers rely on “real-time” predictions provided by NextBus, a company that partners with transit agencies to provide transit information. AC Transit collects GPS data from its buses and sends the information to NextBus, which predicts departure times for each stop, taking into account historical traffic patterns, according to the NextBus website. \n\nNextBus’s prediction service is available on its app and on AC Transit’s website. The Transit app also displays NextBus’s predictions."},{"type":"image","filename":"nextbus","caption":"A screenshot of the NextBus app. Here, the 51B bus to Berkeley Amtrak is predicted to depart from the stop on Bancroft Way and Telegraph Avenue in 2 minutes."},{"type":"text","text":"\nSince most stops don’t have a published schedule, in order to analyze the predictability of bus arrivals, we measured the gap between when the NextBus service <em>says</em> a bus is 20 minutes from a stop and when it <em>actually</em> arrives, according to the service. \n\nLet’s say you’re at the Bancroft Way and Telegraph Avenue bus stop."},{"type":"ai2html","filename":"demo"},{"type":"text","text":"\nThe Daily Californian monitored 45,888 trips for 11 bus routes at 91 stops nearby campus, from September 5, 2017 to October 18, 2017.\n\nBelow, each chart shows a random selection of 100 trips on a given route, along with the proportion that arrived more than five minutes later than predicted. Each arc represents one bus trip, starting 20 minutes before the bus is scheduled to arrive."},{"type":"ai2html","filename":"small-multiples"},{"type":"text","text":"\nSome routes, such as F towards San Francisco and 18 towards Lake Merritt BART, have relatively unpredictable arrivals. Others, such as 6 towards Berkeley BART and 7 towards Berkeley BART arrive as predicted more often.\n\nAverage delay also varies, as F towards Berkeley experiences close to no delay, on average, while the F towards San Francisco in the other direction is often several minutes later than predicted."},{"type":"section-header","text":"Where delays are greatest"},{"type":"text","text":"\nStops, not just routes, have variation in delay. Delays are most prevalent along Shattuck Avenue southbound and Piedmont Avenue southbound. There are often delays on Bancroft Way and Telegraph Avenue, too."},{"type":"d3-graphic","id":"bubble-map"},{"type":"ai2html","filename":"bubble-map"},{"type":"text","text":"\nThe accuracy of predictions is limited by the availability of up-to-the-minute location data, as well as by the unpredictability of traffic patterns and road conditions. Currently, the location of AC Transit buses is recorded and sent to the NextBus service about every two minutes, according to A.J. Martin, a transportation planner at AC Transit. Soon, an upgrade to the tracking technology will enable AC Transit to record and transmit location data every 30 seconds, he said.\n\nAC Transit considers a bus “on time” if it arrives less than five minutes late and not more than one minute early. It aims for its buses to achieve this standard 72 percent of the time. Currently, it is not meeting that goal, according to Martin.\n\nAn internal task force meets monthly to address problematic routes, he added, and considers measures to improve timeliness. These include finding ways for buses to jump the queue at traffic lights, installing “transit-only lanes” that give buses priority and installing devices that enable buses to extend the duration of a green light."},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nWe recorded predicted and actual departure times at stops nearby campus for 12 lines, from 5 a.m. to midnight. Below, you can explore the data for each stop."},{"type":"interactive-map","id":"map-info"},{"type":"nerd-box","text":"More about methodology TK here."}]}
