{"doccategory":"category title","category_link":"http://www.dailycal.org/","headline":"Measuring the on-time performance of ACTransit buses","subhead":"The Daily Californian tracked arrival times at AC Transit bus stops nearby campus and compared them to their scheduled arrivals.","author":"Seokhyeon Ryu","dateline":"October 4, 2017","sections":[{"type":"text","text":"\nDelays are an inevitable experience when riding the bus. Particularly nearby campus and on Shattuck Ave, there are many long waits for the bus to arrive. The main culprit appears to be traffic, which can come to a standstill on busy hours. The Daily Californian investigated the frequency and period of bus delays at stops surrounding campus.\n\nOfficially, ACTransit publishes a schedule for stops considered “important landmarks along the route,” according to its website. For example, the schedule for <span class=\"badge badge-51B\">51B</span><span class=\"db\">Berkeley Amtrak</span> provides times for five stops along that route. These landmark stops may have scheduled times posted at the bus stops themselves. However, the vast majority of stops do not have departure schedules, at the stop or online.\n\nInstead, ACTransit recommends passengers rely on “real-time” predictions procured by NextBus. The technology tracks buses with GPS and predicts their arrival times at each stop. “Research shows that such information reduces passengers’ perceived wait times and, subsequently, their anxieties about delays,” according to <a href=\"http://www.actransit.org/2010/10/27/nextbus%E2%80%9D-a-sign-of-things-to-come/\">a press release</a>. NextBus’s prediction service has been available since 2010, and is available on ACTransit’s website and NextBus app. (Some apps, such as Transit, appear to pull their data directly from NextBus.)"},{"type":"section-header","text":"Defining ‘on-time performance’"},{"type":"text","text":"Since ACTransit promotes using NextBus as the source for scheduled departures at bus stops, the Daily Californian has developed a heuristic for on-time performance based on a bus passenger’s experience. \n\nLet us say you are at the Bancroft Way & Telegraph Ave bus stop."},{"type":"methodology","id":"methodology"},{"type":"text","text":"\nAn arc represents one bus trip, starting at 30 minutes before scheduled arrival. In the example above, the arc ends at when the bus actually arrived, 12 minutes late. On-time performance is defined as arrival no more than 5 minutes late. Below, each graph is a sample of 100 trips at a stop for a selected route."},{"type":"arrivals","id":"route-graphs"},{"type":"text","text":"\nSome routes, such as <span class=\"badge badge-F\">F</span><span class=\"db\">San Francisco</span> and <span class=\"badge badge-18\">18</span><span class=\"db\">Lake Merritt BART</span> have a wide spread of arrivals. Others, like <span class=\"badge badge-51B\">51B</span><span class=\"db\">Berkeley Amtrak</span> and <span class=\"badge badge-36\">36</span><span class=\"db\">West Oakland BART</span>, are more reliably on time. Average delay also varies, as <span class=\"badge badge-F\">F</span><span class=\"db\">Berkeley</span> experiences close to zero average delay while the other direction <span class=\"badge badge-F\">F</span><span class=\"db\">San Francisco</span> averages nearly 5 minutes late. More on methodology is explained at the end of this article."},{"type":"section-header","text":"Where delays are greatest"},{"type":"text","text":"\nStops, not just routes, have variation in delay. In the bubble map below, each stop is represented by a circle whose size is proportional to the stop’s average delay. Delays are highest along Shattuck (southbound) and Piedmont (southbound). There is also a noticeably large average delay on Bancroft Way and Telegraph Ave."},{"type":"d3-graphic","id":"bubble-map"},{"type":"section-header","text":"Measuring delays by time of day"},{"type":"text","text":"\nInteger molestie orci vitae ex euismod egestas. Donec pellentesque ligula non orci vulputate fermentum. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Phasellus aliquet tincidunt arcu. Duis efficitur consectetur ante, ut sollicitudin purus pellentesque et. Donec sit amet risus rutrum, ornare quam nec, ullamcorper nibh. Sed molestie vitae risus efficitur porttitor."},{"type":"d3-graphic","id":"busiest-hist"},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nThe Daily Californian recorded prediction and departure times at stops nearby campus for 12 lines, from 5:00AM to 12:00AM, for a month."},{"type":"interactive-map","id":"map-info"},{"type":"text","text":"\nInteger molestie orci vitae ex euismod egestas. Donec pellentesque ligula non orci vulputate fermentum. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Phasellus aliquet tincidunt arcu. Duis efficitur consectetur ante, ut sollicitudin purus pellentesque et. Donec sit amet risus rutrum, ornare quam nec, ullamcorper nibh. Sed molestie vitae risus efficitur porttitor."}]}
