{"category":"City","category_link":"http://www.dailycal.org/section/news/city/","headline":"Berkeley’s most unpredictable buses","subhead":"We analyzed which buses around UC Berkeley arrive later than expected","author":"Seokhyeon Ryu","dateline":"November 28, 2017","sections":[{"type":"text","text":"\nSahil Hansalia, a campus junior, takes the 51B bus every day to get to class. In the morning, he checks the Transit app on his phone to see when the next bus will arrive. Today, the app predicts the bus will come in 10 minutes. He knows he has a few minutes before he has to leave his apartment.\n\nMost of the time, the prediction is accurate. But some days, it changes. He checks the app five minutes later, and sees the predicted arrival time has increased to 12 minutes.\n\nHe decides to walk to campus instead.\n\n“I’d say 20 percent of the time, (the prediction) gets pushed back,” Hansalia said. “It’s annoying.”\n\nInstead of publishing a schedule for each stop on each bus route, AC Transit recommends passengers rely on real-time predictions provided by NextBus, a company that partners with transit agencies to provide vehicle departure predictions. AC Transit collects GPS data from its buses and sends the information to NextBus, which predicts when the next bus will arrive at each stop, taking traffic patterns into account.\n\nNextBus’s predictions are available on AC Transit’s website, the NextBus app and the Transit app. We wanted to measure how often those predictions, which AC Transit recommends on its website as a way for passengers to “manage (their) time more efficiently,” are accurate."},{"type":"image","filename":"nextbus","caption":"A screenshot of the NextBus app. Here, the 51B to Berkeley Amtrak is predicted to arrive at the stop on Bancroft Way and Telegraph Avenue in two minutes."},{"type":"text","text":"\nSince most stops don’t have a published schedule, we measured the gap between when the NextBus service <em>says</em> a bus is 20 minutes from a stop and when it <em>actually</em> gets there, according to the service.\n\nLet’s say you’re at the Bancroft Way and Telegraph Avenue bus stop."},{"type":"ai2html","filename":"demo"},{"type":"text","text":"\nUsing this approach, The Daily Californian monitored more than 45 thousand trips for 20 bus routes at 80 stops near campus in September and October. We collected data showing which stops and routes have arrival predictions that don’t always come true.\n\n<em><a class=\"jump-down\">[Explore the data for your bus stop]</a></em>\n\nBelow, each chart shows a selection of 100 trips on a route, along with the proportion that arrived more than five minutes later than predicted, which we considered “late.” Each arc represents one bus trip, starting 20 minutes before the bus is expected to arrive."},{"type":"ai2html","filename":"small-multiples"},{"type":"text","text":"\nIn the time period we monitored, almost one third of the arrivals at any stop along the F to San Francisco were later than predicted by more than five minutes. The 18 to Lake Merritt BART was relatively unpredictable as well.\n\nOther buses, such as the 7 to Berkeley BART, arrived as predicted more often. The 51B to Berkeley Amtrak arrived more than five minutes later than predicted only 5 percent of the time. \n\nErika Kodera, a senior who takes the 51B “at least twice a day” because she has class across campus, said the predictions are “pretty accurate,” and have gotten better since she started using the NextBus app more than a year ago.\n\nThe spread in delay time varied, too. Arrivals for the 7 to El Cerrito Del Norte were tightly clustered, but the 52 to U.C. Village, while rarely more than 5 minutes late, saw more varied delay times and often came before it was predicted to arrive.\n\nMichael Medford, a graduate student who says that the service doesn’t give accurate times for the 52, said the unpredictability might be due to construction beginning late in the morning.\n\n“It’s a crapshoot after 10 a.m.,” he said.\n\nWe also found predictions were less accurate in the evening, especially for popular lines such as the 18 and 51B."},{"type":"section-header","text":"Where delays are greatest"},{"type":"text","text":"\nWe analyzed delayed trips at each stop, and found delays clustered along Shattuck Avenue southbound and Piedmont Avenue southbound. Buses arrived later than predicted at stops along Bancroft Way and Telegraph Avenue, too.","#type":"d3-graphic","#id":"bubble-map"},{"type":"ai2html","filename":"bubble-map"},{"type":"text","text":"\nAccording to Tony Gale, the general manager of NextBus, predictions are affected by three factors: bus operators deviating from their schedules, inconsistent tracking data and otherwise unpredictable behavior such as detours and atypical traffic.\n\n“The vehicle must be predictable in order for a prediction to be generated,” he said in a statement.\n\nCurrently, the location of AC Transit buses is recorded and sent to NextBus about every two minutes, according to A.J. Martin, a transportation planner at AC Transit. Soon, an upgrade to the tracking technology will enable AC Transit to record and transmit location data every 30 seconds, he said.\n\nAC Transit considers a bus “on time” if it arrives less than five minutes late, but not more than one minute early. It aims for its buses to achieve this standard 72 percent of the time. Currently, it is not meeting that goal, according to Martin.\n\nAccording to its <a href=\"http://www.actransit.org/wp-content/uploads/OTP_Sys_2014_September.html\">website</a>, AC Transit buses were on time 66 percent of the time on weekdays in September 2014.\n\nAn internal task force meets monthly to address problematic routes, Martin added, and considers measures to improve timeliness. These include finding ways for buses to jump the queue at traffic lights, establishing “transit-only lanes” that give buses priority and installing devices that enable buses to extend the duration of a green light.\n\nNextBus monitors the accuracy of its predictions for each line and stop, but has a tighter bound than The Daily Cal for determining prediction accuracy. While we evaluated the accuracy of predictions when the bus is 20 minutes away from a stop, NextBus evaluates predictions at 5 or 10 minutes away, according to Gale.\n\nPredictions usually get more accurate as the bus gets closer to a stop. Mark Lescroart, a campus visiting scholar, said he uses the NextBus app daily, but when he’s waiting for a bus, he has to periodically check to see if the prediction has updated.\n\n“It’s accurate enough to be worth using,” he said. “But not (enough) to rely on it.”"},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nWe recorded predicted and actual arrivals at stops near campus for 11 lines from 5 a.m. to midnight. Below, you can explore the data for each stop.\n\nStops that have been temporarily changed because of construction do not have accurate predictions, so we excluded them from the map."},{"type":"interactive-map","id":"map-info"},{"type":"nerd-box","text":"\nWe polled the <a href=\"https://www.nextbus.com/xmlFeedDocs/NextBusXMLFeed.pdf\">NextBus API</a> for real-time bus arrival predictions, and observed that the predicted arrival time tended to change as a bus approached a stop. We estimated when each bus arrived at each stop by requesting data every minute until the prediction disappeared. This estimated arrival was compared to the predicted arrival — the arrival time when the bus is 20 minutes away from a stop, according to the service. Stop locations and names are also from the NextBus API.\n\nA bus was considered “late” if its actual arrival time was more than five minutes later than the predicted time.\n\nThe NextBus service predicts when a bus will “arrive” at a stop. Because bus “arrival” and “departure” times are usually very close, we use the terms interchangeably in this article.\n\nThe route explorer was built with <a href=\"http://openlayers.org/\">OpenLayers</a>, an open-source library for creating dynamic maps. To draw bus routes, we used Google Maps to search for bus paths, which we converted into GPX data. The base map is from <a href=\"https://carto.com/location-data-services/basemaps/\">Carto</a>.\n\nThis project is open-source on <a href=\"https://github.com/dailycal-projects/actransit\">GitHub</a>.\n\nSahil Chinoy contributed to this story."}]}
