{"doccategory":"category title","category_link":"http://www.dailycal.org/","headline":"Measuring the on-time performance of ACTransit buses","subhead":"The Daily Californian tracked arrival times at AC Transit bus stops nearby campus and compared them to their scheduled arrivals.","dateline":"October 4, 2017","sections":[{"type":"text","text":"\nDelays are an inevitable part of bus performance."},{"type":"d3-graphic","id":"bubble-map"},{"type":"section-header","text":"Delays are difficult to measure when there’s sparse information on bus schedules."},{"type":"text","text":"Officially, ACTransit publishes a schedule for stops considered “important landmarks along the route,” according to its website. For example, the schedule for 51B To Berkeley Amtrak provides times for five stops along that route. These landmark stops may have scheduled times posted at the bus stops themselves, although this is no guarantee.\n\nInstead, ACTransit recommends passengers rely on “real-time” predictions procured by NextBus. The technology tracks buses with GPS and predicts their arrival times at each stop. “Research shows that such information reduces passengers’ perceived wait times and, subsequently, their anxieties about delays,” according to <a href=\"http://www.actransit.org/2010/10/27/nextbus%E2%80%9D-a-sign-of-things-to-come/\">a press release</a>. NextBus’s prediction service has been available since 2010, and is available on ACTransit’s website and NextBus app. (Other apps may or may not use NextBus)\n\nSince real-time prediction is the preferred source of scheduled arrivals, the Daily Californian has developed the following heuristic for defining on-time performance. Let us say you are at the Bancroft Way & Telegraph Ave bus stop."},{"type":"methodology","id":"methodology"},{"type":"text","text":"\nMore on our methodology is explained at the end of this article."},{"type":"arrivals","id":"route-graphs"},{"type":"section-header","text":"Measuring delays by time of day"},{"type":"text","text":"\nInteger molestie orci vitae ex euismod egestas. Donec pellentesque ligula non orci vulputate fermentum. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Phasellus aliquet tincidunt arcu. Duis efficitur consectetur ante, ut sollicitudin purus pellentesque et. Donec sit amet risus rutrum, ornare quam nec, ullamcorper nibh. Sed molestie vitae risus efficitur porttitor."},{"type":"d3-graphic","id":"busiest-hist"},{"type":"section-header","text":"Explore stops and routes nearby"},{"type":"text","text":"\nInteger molestie orci vitae ex euismod egestas. Donec pellentesque ligula non orci vulputate fermentum. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Phasellus aliquet tincidunt arcu. Duis efficitur consectetur ante, ut sollicitudin purus pellentesque et. Donec sit amet risus rutrum, ornare quam nec, ullamcorper nibh. Sed molestie vitae risus efficitur porttitor."},{"type":"interactive-map","id":"map-info"},{"type":"text","text":"\nInteger molestie orci vitae ex euismod egestas. Donec pellentesque ligula non orci vulputate fermentum. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Phasellus aliquet tincidunt arcu. Duis efficitur consectetur ante, ut sollicitudin purus pellentesque et. Donec sit amet risus rutrum, ornare quam nec, ullamcorper nibh. Sed molestie vitae risus efficitur porttitor."}]}
